interface Case {
    message: string;
    value: number;
}

const regularCases: Case[] = [
    // mega bonus
    {
        message:
            'Тобі випав дуже рідкий шанс мати участь в 10-ти часовій оргії транссексуалів! 😏 Це було неперевершено...',
        value: 30,
    },
    {message: 'Тебе згвалтував найліпший друг...', value: 10},
    {message: 'Що це? Таке приємне відчуття знизу...', value: 16},

    // mega de-bonus
    {message: 'Ти випадково вронив ножа собі проміж ніг...', value: -40},

    {message: 'Ти грав зі своїм пенісом та програв.', value: -2},
    {message: 'Всім тепер відомо як виглядає твій прутень.', value: 4},
    {
        message:
            "Класичне питання 'Вже все?' прозвучало на 15 секунд раніше, ніж ти очікував.",
        value: -3,
    },
    {
        message:
            'Застібаючи ширінку, ти відчув різкий біль і зраду від власної блискавки.',
        value: -1,
    },
    {message: 'Фурря в VRChat випадково потерлася об тебе дупкою.', value: 6},
    {message: 'Це була кретична помилка - кінчати тут.', value: -1},
    {message: 'Ти був хорошим хлопчиком сьогодні...', value: 5},
    {message: 'А ти виглядаеш мило в цій спідниці!', value: 5},
    {message: 'Тобі сьогодні не вдалося відкалібруватися.', value: -3},

    // from gemini tier1
    {
        message: 'Тебе погладили по голівці в VRChat... по тій, що в штанах.',
        value: 4,
    },
    {
        message: 'Вона сказала, що твої стогони — її улюблена музика.',
        value: 7,
    },
    {
        message: 'Твій дікпік оцінили на 10/10. Можна в рамочку і на стіну.',
        value: 6,
    },
    {
        message:
            'Ти виграв катку 1v5, і твій член виріс від почуття власної величі.',
        value: 3,
    },
    {
        message: 'Твої панчохи зібрали більше компліментів, ніж її сукня.',
        value: 5,
    },
    {message: 'Тебе назвали "котиком". Ти мурчав до кінця дня.', value: 4},
    {message: 'Ти тримався довше, ніж оборона Маріуполя. Легенда.', value: 8},
    {
        message: 'Твій солдат відмовився піднімати прапор. Дезертир.',
        value: -5,
    },
    {message: 'Сів на власного дружка. Обидва були в шоці.', value: -3},
    {message: 'Ти випадково надіслав дікпік у робочий чат.', value: -8},
    {
        message:
            'Після "калібрування" ти подивився на себе в дзеркало. Розчарування було безмежним.',
        value: -4,
    },
    {
        message:
            'Твій full-body трекінг заглючив у найпікантніший момент, і ти застряг у непристойній позі.',
        value: -4,
    },
    {message: 'Подумав про свою бабусю. Гра закінчена.', value: -7},
    {
        message:
            'Ти скинув їй мем, а вона відповіла "не смішно". Твій прутень зів\'яв від розчарування.',
        value: -2,
    },
    {
        message:
            'Під час процесу твій живіт видав звук, схожий на вмираючого кита.',
        value: -2,
    },
    {message: "Ти випадково назвав її ім'ям персонажа з аніме.", value: -6},

    // from gemini tier2
    {
        message:
            'Ти використав свої APM навички, щоб розстібнути її ліфчик за 0.5 секунди.',
        value: 6,
    },
    {
        message:
            'Вона сказала, що готова платити за підписку на твій OnlyFans, якби він у тебе був.',
        value: 8,
    },
    {
        message:
            'Твій кастомний аніме-аватар з фізикою прутня пройшов модерацію.',
        value: 7,
    },
    {
        message:
            'Ти успішно завершив, незважаючи на те, що ногу звела судома. Справжній воїн.',
        value: 4,
    },
    {
        message:
            'Вона одягнула на тебе ошийник. Ти був дуже слухняним і отримав нагороду.',
        value: 5,
    },
    {
        message:
            'Ти так впевнено купив презервативи, що касирка підморгнула тобі.',
        value: 3,
    },
    {
        message: "Твоя п'ята точка виглядає в цих лосинах краще, ніж її.",
        value: 4,
    },

    {
        message:
            'Вона знайшла твій акаунт на DeviantArt з 2014 року. Від сорому член втягнувся назавжди.',
        value: -1,
    },
    {
        message:
            'Пост-коітальна ясність вдарила з такою силою, що ти почав сумніватися у всіх своїх життєвих рішеннях.',
        value: -3,
    },
    {
        message:
            'Ти спробував зробити "ахегао", але більше було схоже, що в тебе інсульт.',
        value: -2,
    },
    {
        message:
            'Батьки увійшли в кімнату, коли ти пояснював другові в Discord, що таке "phantom sense".',
        value: -3,
    },
    {
        message:
            'Під час мінету ти чхнув. Вибачень було багато, але осад залишився.',
        value: -8,
    },
    {message: 'Твій прутень заснув раніше, ніж ти. Зрадник.', value: -1},
    {
        message:
            'Вона попросила тебе говорити брудні речі, а ти зміг видавити лише "Е... ти така... гарна?".',
        value: -2,
    },
    {
        message:
            'Ти надів її трусики собі на голову, а вони виявились не свіжими.',
        value: -3,
    },

    // 20:54 12 Jun 2025 from Gemini
    {
        message:
            'Вона сказала, що розмір не головне, і цього разу це звучало щиро. Мабуть.',
        value: 4,
    },
    {
        message:
            "Твій класичний мув 'позіхнути і обійняти' спрацював. Ти — геній тактики.",
        value: 3,
    },
    {
        message:
            'Вона образилась на тебе без причини, тому секс був особливо пристрасним. Дивна логіка, але вона працює.',
        value: 6,
    },
    {
        message:
            'Ти вийшов з душу, і пара від дзеркала приховала твої недоліки. На мить ти відчув себе Аполлоном.',
        value: 2,
    },
    {
        message:
            'Вона побачила твою історію пошуку і замість скандалу попросила посилання. Споріднена душа!',
        value: 5,
    },
    {
        message:
            'Ти приміряв її ліфчик заради жарту, і він ідеально тобі підійшов. Нові горизонти відкрито.',
        value: 3,
    },
    {
        message:
            'Ти так голосно стогнав, що сусіди почали аплодувати. Або стукати по батареї. Важко розібрати.',
        value: 4,
    },
    {
        message:
            'Вона заснула першою, і ти зміг спокійно пограти в Elden Ring. Маленька перемога.',
        value: 1,
    },
    {
        message:
            "Ти майстерно ухилився від питання 'Про що ти думаєш?', відповівши 'Про тебе, кохана'.",
        value: 4,
    },
    {
        message:
            'Ти зняв штани, а він уже спав. Навіть не спробував повоювати.',
        value: -3,
    },
    {
        message:
            'Вона запитала, чи не виглядає вона товстою в цій сукні. Це була пастка, і ти в неї потрапив.',
        value: -2,
    },
    {
        message:
            'Під час процесу твоїй мамі в Telegram сподобалось ваше спільне фото. Телефон був поруч. На повній гучності.',
        value: -3,
    },
    {
        message:
            'У найвідповідальніший момент ти видав такий звук, який зазвичай вимагає зміни білизни. Атмосфера зіпсована.',
        value: -3,
    },
    {
        message:
            'Ти хотів зробити їй комплімент, сказавши, що вона гаряча, як реактор в Чорнобилі. Вона вчила історію.',
        value: -2,
    },
    {
        message:
            "Після всього вона запитала: 'Про що ти зараз думаєш?'. Ти думав про те, чи вистачить пельменів на вечерю.",
        value: -1,
    },
    {
        message:
            'Твій кіт вирішив, що саме зараз час застрибнути тобі на спину. Романтика скінчилась.',
        value: -2,
    },
    {
        message:
            'Ти помітив, що не стриг нігті на ногах вже місяць. Це відкриття вдарило по твоїй самооцінці.',
        value: -1,
    },
    {
        message:
            'Вона сказала, що твій прутень нагадує їй її колишнього. Ти не став уточнювати, в якому сенсі.',
        value: -3,
    },

    // 12:55 12 Jun 2025 from Gemini
    // from gemini tier3
    {message: 'Твій пеніс успішно пройшов апдейт ядра.', value: 3},
    {
        message: "Вона назвала твій член 'маленьким, але дуже вправним'.",
        value: 2,
    },
    {
        message: "Ти випадково сказав 'Я в Arch' замість 'Я вже все'.",
        value: -1,
    },
    {
        message: 'Твої стогони були настільки гучними, що розбудили сусідів.',
        value: 1,
    },
    {
        message: 'Випадково переключив мову під час розмови про пеніс.',
        value: -1,
    },
    {
        message:
            'Вона попросила розповісти про свою улюблену операційну систему. Ти почав з GRUB.',
        value: -2,
    },
    {message: "Твій 'пакет' розпакувався занадто швидко.", value: -3},
    {
        message:
            "Жінка запитала, чи ти любиш сюрпризи. Ти відповів: 'Лише ті, що не ламають мою систему'.",
        value: -1,
    },
    {
        message:
            'Ти знайшов її приховану колекцію аніме-фігурок. Вона була вражена, що ти їх розпізнав.',
        value: 3,
    },
    {
        message: "Вона прошепотіла: 'Ти такий же надійний, як ArchWiki'.",
        value: 5,
    },
    {
        message: 'Ти згадав про свій скріншот з неофечем і вона розсміялася.',
        value: 1,
    },
    {
        message: 'Твій пеніс раптово вирішив оновитися і не завантажився.',
        value: -3,
    },
    {
        message:
            'Вона сказала, що твій підхід до сексу такий же мінімалістичний, як Arch.',
        value: 0,
    },
    {
        message:
            'Ти пояснив їй, що таке Wayland, і вона заснула. Хоча... може, це був плюс.',
        value: -2,
    },
    {message: 'Твій пеніс застряг у циклі перевантаження.', value: -3},
    {
        message:
            "Вона попросила тебе 'компілювати' довше. Ти не зрозумів натяку.",
        value: -1,
    },
    {
        message:
            "Ти спробував налаштувати 'сплячий режим' для свого пеніса, але він не прокинувся.",
        value: -2,
    },
    {
        message:
            "Вона запропонувала тобі 'sudo make me a sandwich'. Ти зробив, але забув про секс.",
        value: -2,
    },
    {
        message: "Твій пеніс досяг максимальної швидкості 'завантаження'.",
        value: 6,
    },
    {
        message:
            "Ти випадково натиснув 'Ctrl+Alt+Del' у найвідповідальніший момент.",
        value: -3,
    },
    {
        message:
            "Вона порівняла тебе з bash-скриптом: 'Багато команд, але не завжди те, що потрібно'.",
        value: -2,
    },
    {
        message:
            "Твій пеніс 'демонізувався' і почав працювати у фоновому режимі.",
        value: 0,
    },
    {
        message:
            "Ти спробував застосувати 'DRY' принцип до своїх стосунків, але це не спрацювало.",
        value: -1,
    },
    {
        message:
            "Вона сказала, що ти 'зламав' її серце, але потім додала, що це було приємно.",
        value: 2,
    },
    {
        message: 'Ти заплутався в кабелях і це було смішно, але не сексуально.',
        value: -1,
    },
    {message: "Твій пеніс показав 'kernel panic'.", value: -3},
    {
        message: "Вона зробила комплімент твоєму вміння 'дебажити' проблеми.",
        value: 4,
    },
    {
        message: "Ти випадково увімкнув 'режим відладки' і тепер все видно.",
        value: -1,
    },
    {message: "Твоя дівчина запитала, чи ти не 'перегріваєшся'.", value: 0},
    {
        message:
            "Ти спробував 'відкат' до попередньої версії себе, але було пізно.",
        value: -2,
    },
    {message: "Вона сказала, що твій пеніс 'завис'.", value: -3},
    {
        message: "Ти зміг 'підключитися' до неї швидше, ніж до Wi-Fi.",
        value: 4,
    },
    {
        message:
            'Вона дізналася, що ти досі користуєшся KDE. Це її трохи відштовхнуло.',
        value: -2,
    },
    {message: "Твій пеніс відмовився 'монтуватися'.", value: -3},
    {message: "Ти забув про 'пароль' до її серця.", value: -1},
    {message: "Вона сказала, що твої рухи були 'оптимізовані'.", value: 3},
    {message: 'Ти випадково відкрив VIM замість браузера.', value: -1},
    {message: "Твій пеніс 'завантажувався' довше, ніж Windows.", value: -3},
    {
        message:
            "Вона похвалила твою здатність 'налаштовувати' її задоволення.",
        value: 6,
    },

    // 12:59 12 Jun 2025 from Gemini
    {message: 'Твій пеніс застряг у рекурсії.', value: -3},
    {
        message:
            'Відкрив холодильник, щоб попити води, і раптово відчув порожнечу в житті.',
        value: -2,
    },
    {
        message:
            'Ти одягнув спідницю і відчув себе на мільйон доларів. Вона погодилася.',
        value: 5,
    },
    {
        message:
            'Твій новий манікюр отримав більше компліментів, ніж твоя робота.',
        value: 3,
    },
    {
        message: "Вона назвала тебе 'її маленькою принцесою'. Ти мурчав.",
        value: 4,
    },
    {
        message:
            'Випадково забув поголити ноги перед побаченням. Трохи незручно.',
        value: -1,
    },
    {
        message: 'Ти спробував нанести макіяж, але вийшло як у Пеннівайза.',
        value: -2,
    },
    {
        message:
            'Твій партнер повністю прийняв твій фембой-стиль і навіть купив тобі новий топ.',
        value: 6,
    },
    {message: 'Ти заплутався в панчохах і впав. Несексуально.', value: -1},
    {
        message:
            'Вона сказала, що твої ноги виглядають краще в панчохах, ніж її.',
        value: 4,
    },
    {
        message:
            'Тебе прийняли за дівчину в громадському туалеті. Це було... неочікувано.',
        value: -1,
    },
    {
        message:
            'Ти успішно завершив фотосесію в новому образі і отримав купу лайків.',
        value: 5,
    },

    // by @Virussel
    {
        message: 'Ти просто заснув у ліжку з відкритим порно...',
        value: -1,
    },
    {
        message: 'Ти випадково відкрив VIM замість браузера.',
        value: -1,
    },
    {
        message:
            'Ти хотів подрочити, але потім згадав що це не варте того... Краще піти поспати чи подивитися кіно...',
        value: -1,
    },
    {
        message:
            'Швиденько потер прутня та пійшов далі займатися своїми справами...',
        value: 3,
    },

    // new 16 jun 2025
    {
        message:
            'Ти протримався в обіймах 8 годин, і твоя рука не заніміла. Ти — титан ніжності.',
        value: 10,
    },
    {
        message:
            'Твоя RGB-клавіатура синхронізувалася з її стогонами. Технології майбутнього!',
        value: 7,
    },
    {
        message:
            'Вона побачила, що ти слухаєш фонк, і її трусики миттєво стали мокрими.',
        value: 6,
    },
    {
        message:
            'Ти майстерно виконав кунілінгус, наче грав у ритм-гру на максимальній складності.',
        value: 8,
    },
    {
        message:
            'Ти настільки гарно виглядаєш у корсеті, що навіть твій гетеро-друг зробив тобі комплімент.',
        value: 5,
    },
    {
        message:
            "Твій 'phantom touch' спрацював так сильно, що вона кінчила, хоча ви були в різних кімнатах.",
        value: 9,
    },
    {
        message:
            "Вона сказала, що твій прутень — ідеальний приклад 'user-friendly' дизайну.",
        value: 4,
    },
    {
        message:
            'Ти успішно ухилився від аліментів. +2 до хитрості, -5 до карми.',
        value: 2,
    },
    {
        message:
            'Вона використала твою улюблену худі, щоб витерти... наслідки. Святиню було осквернено.',
        value: -9,
    },
    {
        message:
            "Ти спробував пояснити їй гілки в Git під час прелюдії. Тепер ти у гілці 'celibate'.",
        value: -5,
    },
    {
        message:
            "Твій прутень вирішив, що 'post-nut clarity' має настати ще до початку.",
        value: -6,
    },
    {
        message:
            "Твоя розумна колонка голосно оголосила: 'Новий пристрій підключено'. Обидва здригнулися.",
        value: -4,
    },
    {
        message:
            "Спроба нової пози з Камасутри закінчилася розтягненням м'яза. Тепер ти сексуальний, але нерухомий.",
        value: -3,
    },
    {
        message:
            'Твої панчохи постійно сповзали, перетворюючи спокусливий вечір на нескінченну боротьбу з гравітацією.',
        value: -2,
    },
    {
        message:
            "Вона прошепотіла 'Сильніше', а ти почув 'Сирніше' і почав розповідати про свою любов до пармезану.",
        value: -6,
    },
    {
        message:
            'Твій живіт вирішив виконати соло саме в момент, коли настала ідеальна тиша.',
        value: -3,
    },
    {
        message:
            'Вона знайшла твою колекцію фуррі-арту. На диво, їй сподобалось.',
        value: 7,
    },
    {
        message:
            "Ти випадково надіслав їй дікпік з увімкненим фільтром 'собачі вушка'. Несподівано, але мило.",
        value: 1,
    },
    {
        message:
            'Твій голос зламався, коли ти намагався сексуально прошепотіти їй щось на вушко.',
        value: -4,
    },
    {
        message:
            "Ти був настільки п'яний, що намагався засунути його в її ніздрю. Протверезіння було болючим.",
        value: -10,
    },
    {
        message:
            'Ти відкрив для себе дивовижний світ пегінгу. Анальний горизонт розширено.',
        value: 10,
    },
    {
        message:
            'Вона нафарбувала тобі губи червоною помадою лише для того, щоб потім її злизати.',
        value: 8,
    },
    {
        message:
            "Твій 'aim assist' під час пестощів був налаштований ідеально. Кожен дотик — хедшот.",
        value: 7,
    },
    {
        message:
            'Ти надів на себе котячі вушка, і вона весь вечір гладила тебе за ними. Мур-мур.',
        value: 6,
    },
    {
        message:
            "Вона попросила тебе 'sudo make love'. Ти виконав команду з найвищими привілеями.",
        value: 9,
    },
    {
        message:
            'Твій прутень досяг такого рівня просвітлення, що тепер може компілювати ядро Gentoo.',
        value: 5,
    },
    {
        message:
            'Ви посварились, і секс примирення був настільки гарячим, що міг би живити невелике місто.',
        value: 7,
    },
    {
        message: 'Ти випадково вилив на неї лубрикант. Вона не була проти.',
        value: 3,
    },
    {
        message:
            'Твій прутень показав синій екран смерті. Потрібне екстрене перезавантаження.',
        value: -7,
    },
    {
        message:
            "Ти забув про 'git pull' вчасно. Тепер доведеться розбиратися з 'merge conflicts' через 9 місяців.",
        value: -15,
    },
    {
        message:
            "Ти прошепотів 'gg wp' після сексу. Вона не оцінила гумору і поставила тобі 'report'.",
        value: -5,
    },
    {
        message:
            'Твою ногу звела настільки сильна судома, що довелося викликати екзорциста. Романтика померла.',
        value: -4,
    },
    {
        message:
            "Ти спробував зробити 'вертольотик', але вдарився об тумбочку. Обидва були травмовані.",
        value: -6,
    },
    {
        message:
            'Під час сексу ти думав про те, чи правильно розставив пріоритети в тасках на Jira.',
        value: -3,
    },
    {
        message:
            'Твоя улюблена пісня заграла в плейлисті для сексу. Ти почав підспівувати, забувши про все.',
        value: -2,
    },
    {
        message:
            "Вона сказала, що твій прутень 'милий'. Це було не те слово, яке ти хотів почути.",
        value: -4,
    },
    {
        message:
            "Вона побачила твою історію пошуку 'як збільшити член в домашніх умовах'. Ви довго сміялися.",
        value: 1,
    },
    {
        message:
            'Ти намагався бути домінантним, але заплутався в ременях портупеї.',
        value: -3,
    },
    {
        message:
            "Кур'єр Glovo приїхав у найвідповідальніший момент. Довелося робити незручний вибір.",
        value: -5,
    },
    {
        message:
            "Ти зрозумів, що таке 'пост-коітальна ясність', коли почав прибирати квартиру о 3 годині ночі.",
        value: -1,
    },
    {
        message:
            'Ти одягнув спідницю, і твій хлопець сказав, що в тебе ноги гарніші, ніж у нього. Це перемога.',
        value: 6,
    },
    {
        message:
            'Твої стрілки на очах вийшли ідеально симетричними. Тепер ти готовий підкорювати світ... або хоча б Discord-сервер.',
        value: 5,
    },
    {
        message:
            "Ти покрутився у своїй спідничці, і вона зробила 'вжух'. Відчуття абсолютної влади і милоти.",
        value: 8,
    },
    {
        message:
            'Ти поділився своїм справжнім іменем з партнером, і він почав його використовувати одразу ж, без жодних питань. Безцінно.',
        value: 15,
    },
    {
        message:
            'Симпатичний бариста підморгнув тобі і намалював сердечко на твоїй каві. День обіцяє бути цікавим.',
        value: 6,
    },
    {
        message:
            'Ти зрозумів, що панчохи — це не просто одяг, а +10 до впевненості та +15 до спокусливості.',
        value: 7,
    },
    {
        message:
            'Поголив ноги і тепер лежиш під ковдрою, насолоджуючись неймовірною гладкістю. Маленький рай.',
        value: 4,
    },
    {
        message:
            'Виявилося, що ви обидва пасиви. Вечір перетворився на турнір з настільних ігор та обіймів.',
        value: 1,
    },
    {
        message:
            'Ти з натхненням натягував свої улюблені панчохи, і... вони порвалися. Вечір зіпсовано, як і настрій.',
        value: -4,
    },
    {
        message:
            "Касирка в магазині назвала тебе 'молодий чоловіче'. Напад гендерної дисфорії зіпсував весь день.",
        value: -7,
    },
    {
        message:
            'Він виглядав як Адоніс на фото в Grindr, а в реальності — як його дядько після трьох днів запою.',
        value: -5,
    },
    {
        message:
            'Спроба потренувати жіночний голос закінчилася звуком, схожим на вмираючого птеродактиля.',
        value: -4,
    },
    {
        message:
            'Ти так впевнено йшов у своєму новому образі, що випадково зайшов у жіночу вбиральню. Паніка була космічного масштабу.',
        value: -3,
    },
    {
        message:
            "Ви цілу годину сперечалися, хто сьогодні 'велика ложка'. Врешті-решт заснули спиною до спини.",
        value: -2,
    },
    {
        message:
            "Твій батько знайшов твій 'секретний' ящик з косметикою. Розмова була довгою і незручною.",
        value: -8,
    },
    {
        message:
            'Ти забув змити макіяж перед сном і тепер твоя подушка виглядає як полотно абстракціоніста.',
        value: -1,
    },
    {
        message:
            "Його профіль обіцяв 'ніжність та романтику', а він одразу надіслав дікпік. Класика.",
        value: -3,
    },
    {
        message:
            'Тебе погладили по голові, і ти мимоволі замуркотів. Інстинкти котика-хлопчика взяли гору.',
        value: 4,
    },
    {
        message:
            "Він назвав тебе 'гарним хлопчиком', і твій хвостик... уявний хвостик... завиляв від щастя.",
        value: 9,
    },
    {
        message:
            'Ти нарешті підібрав тональний крем, який ідеально підходить до твоєї шкіри. Це було складніше, ніж будь-який бос у Dark Souls.',
        value: 5,
    },
    {
        message:
            'Ти фінішував з такою силою, що віддача залишила невеликий синець. Бойове хрещення пройдено.',
        value: 7,
    },
    {
        message:
            'Ви кінчили одночасно. Синхронізація 100%. Ви — ідеальна команда для co-op режиму.',
        value: 10,
    },
    {
        message:
            'Твій постріл був настільки точним, що потрапив їй прямо в ямочку на щоці. Снайпер.',
        value: 8,
    },
    {
        message:
            'Оргазм був таким потужним, що на мить ти побачив усі можливі гілки розвитку в Git.',
        value: 6,
    },
    {
        message:
            "Ти випустив такий об'єм, що вона жартома запропонувала тобі відкрити власний банк сперми.",
        value: 9,
    },
    {
        message:
            "Вона сказала 'Кінчай', і ти виконав команду з пінгом у 1 мс. Ідеальне виконання.",
        value: 7,
    },
    {
        message:
            "Після твого фіналу вона подивилася на тебе і прошепотіла: 'Це було легендарно'.",
        value: 12,
    },
    {
        message:
            'Ти тримався так довго, що вона вже почала думати, ніби в тебе нескінченні патрони. А потім ти влаштував салют.',
        value: 8,
    },
    {
        message:
            'Твій фініш був схожий на виверження Везувію. Історична подія, яку внесуть у літописи.',
        value: 10,
    },
    {
        message:
            "Вона спробувала твою сперму і сказала, що на смак, як 'перемога'.",
        value: 9,
    },
    {
        message:
            'Ти кінчив їй на груди, створивши ідеальний перламутровий візерунок. Ти — художник.',
        value: 6,
    },
    {
        message:
            'Від оргазму ти закричав так голосно, що твій кіт злякався і впав з підвіконня. Маленька жертва заради великого задоволення.',
        value: 5,
    },
    {
        message:
            "Ти успішно 'розгорнув прод' прямо їй на обличчя. Деплой пройшов без помилок.",
        value: 8,
    },
    {
        message:
            'Задоволення було настільки інтенсивним, що ти відчув, ніби розблокував нове досягнення в Steam.',
        value: 7,
    },
    {
        message:
            'Ти кінчив, і світ на мить засяяв, наче хтось кинув світлошумову гранату. Ефектно.',
        value: 9,
    },
    {
        message:
            'Ти кінчив, і в цей момент на твій рахунок в Steam впали гроші на всі ігри зі списку бажаного. Гейб Ньюелл відчуває твою енергію.',
        value: 20,
    },
    {
        message:
            'Твій стогін випадково виявився ідеальним паролем до Wi-Fi сусіда. Тепер у тебе є безкоштовний інтернет і почуття переваги.',
        value: 8,
    },
    {
        message:
            'Ти крутнувся у своїй спідниці, і це викликало ефект метелика, що призвело до падіння акцій ненависної тобі компанії. Ти — агент хаосу.',
        value: 15,
    },
    {
        message:
            'Твій прутень засвітився, як індикатор сповіщень на телефоні, коли вона була збуджена. Вбудований детектор бажання.',
        value: 9,
    },
    {
        message:
            'Ти випадково вимовив заклинання на латині, яке почув у фільмі, і всі твої шкарпетки самі знайшли собі пару. Побутова магія.',
        value: 7,
    },
    {
        message:
            'Твій пердіж під час сексу прозвучав у ідеальній гармонії з басом у треку, що грав на фоні. Ви створили ремікс.',
        value: 6,
    },
    {
        message:
            'Ти наніс макіяж настільки майстерно, що технологія Face ID на твоєму телефоні визнала тебе більш красивою версією себе і самознищилась від сорому.',
        value: 10,
    },
    {
        message:
            "Під час оргазму ти випадково вирішив складну математичну теорему. 'Пост-коітальна ясність' виявилася суперсилою.",
        value: 12,
    },
    {
        message:
            'Він сказав, що твої сідниці в лосинах настільки ідеальні, що їх треба виставити в Луврі замість Венери Мілоської.',
        value: 8,
    },
    {
        message:
            'Ти чхнув, і з тебе вилетів невеликий, але ідеально сформований веселковий єдиноріг з блискіток. Вона була в захваті.',
        value: 11,
    },
    {
        message:
            'Після сексу ти пішов у душ і виявив, що тепер розумієш мову качок. Вони говорять про досить нудні речі.',
        value: 5,
    },
    {
        message:
            'Твій дікпік був настільки вражаючим, що отримав статус NFT і був проданий за 3 ETH. Тепер ти крипто-магнат.',
        value: 18,
    },
    {
        message:
            'Твій голос після прийому гормонів став настільки приємним, що твій GPS-навігатор попросив тебе надиктувати для нього нові репліки.',
        value: 9,
    },
    {
        message:
            "Ти так сильно стиснув свої сідниці, що зміг розколоти волоський горіх. Твоя п'ята точка — це зброя.",
        value: 7,
    },
    {
        message:
            "Ти випадково підключився до Bluetooth-колонки сусідів і транслював їм свої стогони. Вранці вони залишили під дверима пляшку вина і записку 'На біс!'",
        value: 10,
    },
    {
        message:
            'Вона сказала, що твої навички в ліжку мають креативність GPT-4 і швидкість Llama 3. Ти — модель нового покоління.',
        value: 10,
    },
    {
        message:
            "Ти попросив LLM згенерувати ідеальний сценарій для рольової гри. Вона була настільки вражена, що тепер називає тебе 'Майстер Промптів'.",
        value: 8,
    },
    {
        message:
            "Твій 'jailbreak' промпт був настільки витонченим, що модель не лише видала еротичне оповідання, а й додала: 'Чекаю на продовження, котику'. Ти спокусив машину.",
        value: 7,
    },
    {
        message:
            "Ти так довго 'файн-тюнив' її на своїх фетишах, що тепер вона знає твої бажання краще, ніж ти сам. Модель ідеально навчена.",
        value: 9,
    },
    {
        message: 'Hacked...',
        value: 100,
    },
];

class CaseManager {
    private currentIndex: number = Math.floor(
        Math.random() * regularCases.length,
    );

    getRandomCase(): Case {
        this.currentIndex += 1;
        if (this.currentIndex >= regularCases.length) this.currentIndex = 0;
        return regularCases[this.currentIndex];
    }
}

export {Case, CaseManager};
